tutorials/multiphaseReactiveTransport/interReactiveTransferFoam/2DCavity/0_org/HCO3-
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      HCO3-;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0; 

boundaryField
{
    right
    {
        type            zeroGradient;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            globalConcentrationMixed;
        value           uniform 0.0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
